In [1]:
# imporitng the libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# import the dataset
df = pd.read_csv("cars.csv")

df.head()

,Unnamed: 0,Make,Type,Year,Origin,Color,Options,Engine_Size,Fuel_Type,Gear_Type,Mileage,Region,Price,Negotiable
0,6153,Toyota,Camry,2020,Saudi,Brown,Semi Full,2.5,Gas,Automatic,38000,Riyadh,1364,False
1,4434,Toyota,FJ,2012,Saudi,Black,Full,4.0,Gas,Automatic,35000,Riyadh,70000,False
2,3537,Chevrolet,Suburban,2009,Saudi,White,Standard,5.3,Gas,Automatic,255,Riyadh,36000,False
3,1666,Ford,Explorer,2016,Other,White,Full,3.5,Gas,Automatic,128644,Riyadh,118000,False
4,3513,Toyota,Corolla,2018,Saudi,White,Standard,1.6,Gas,Automatic,19190,Jeddah,55000,False

#### The features in the dataset
- Make: Car company'name
- Type: Car type
- Year: Production year
- Origin: If  it from Saudi Arabia or Gulf countries or other
- Color: Car color
- Options: Full, Semi Full, Standard
- Engine_Size
- Fule_Type: Gas, Diesel, Hybrid
- Gear_Type: Automatic, Manual
- Mileage: the distance travel
- Region: the region of the car
- Price: price of the car (if 0 or 1 it means open for auction)
- Negotiable: (True/False) if the price is negotiable

### Exploring the data

In [5]:
# How many rows and columns?
df.shape

(6428, 14)

In [6]:
# What are the column names?
df.columns

Index(['Unnamed: 0', 'Make', 'Type', 'Year', 'Origin', 'Color', 'Options',
       'Engine_Size', 'Fuel_Type', 'Gear_Type', 'Mileage', 'Region', 'Price',
       'Negotiable'],
      dtype='object')

In [7]:
# Show a quick summary statistics of the numerical variables we have
df.describe()

        Unnamed: 0         Year  Engine_Size       Mileage         Price
count  6428.000000  6428.000000  6428.000000  6.428000e+03  6.428000e+03
mean   4001.298538  2014.120566     3.299284  1.476798e+05  5.395469e+04
std    2308.032075     5.690005     1.523697  3.582324e+05  7.300146e+04
min       0.000000  1964.000000     1.000000  1.000000e+02  0.000000e+00
25%    2003.750000  2012.000000     2.000000  3.700000e+04  0.000000e+00
50%    3998.500000  2016.000000     3.000000  1.018995e+05  3.700000e+04
75%    5979.250000  2018.000000     4.500000  1.950000e+05  7.300000e+04
max    8034.000000  2022.000000     9.000000  2.000000e+07  1.150000e+06

In [8]:
# what are the types of values in each column?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6428 entries, 0 to 6427
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   6428 non-null   int64
 1   Make         6428 non-null   object
 2   Type         6428 non-null   object
 3   Year         6428 non-null   int64
 4   Origin       6428 non-null   object
 5   Color        6428 non-null   object
 6   Options      6428 non-null   object
 7   Engine_Size  6428 non-null   float64
 8   Fuel_Type    6428 non-null   object
 9   Gear_Type    6428 non-null   object
 10  Mileage      6428 non-null   int64
 11  Region       6428 non-null   object
 12  Price        6428 non-null   int64
 13  Negotiable   6428 non-null   bool
dtypes: bool(1), float64(1), int64(4), object(8)
memory usage: 659.2+ KB

In [9]:
# show the last 5 rows of the dataset
df.tail(5)

,Unnamed: 0,Make,Type,Year,Origin,Color,Options,Engine_Size,Fuel_Type,Gear_Type,Mileage,Region,Price,Negotiable
6423,6017,Mercedes,CLS,2014,Saudi,Brown,Full,3.5,Gas,Automatic,130,Jeddah,100000,False
6424,709,GMC,Acadia,2014,Saudi,Red,Full,3.6,Gas,Automatic,250000,Khobar,50000,False
6425,2487,Audi,Q5,2018,Saudi,Another Color,Standard,2.5,Gas,Automatic,17000,Jeddah,138000,False
6426,174,Renault,Symbol,2020,Saudi,White,Standard,1.6,Gas,Automatic,46505,Riyadh,26000,False
6427,1146,Ford,Expedition,2006,Other,Black,Full,5.4,Gas,Automatic,341,Al-Jouf,0,True

In [10]:
# how many unique value in Make column
df.Make.nunique()

59

In [35]:
# what are the unique value in Year column
df.Year.unique()

array([2020, 2012, 2009, 2016, 2018, 2003, 1998, 2013, 2017, 2010, 2014,
       2019, 2015, 2002, 2006, 2001, 2021, 2007, 2008, 2011, 2004, 2005,
       1983, 1990, 1999, 1985, 1996, 1997, 1995, 2000, 1994, 1986, 1989,
       1991, 1993, 1992, 1979, 1977, 1972, 1970, 1988, 1964, 1978, 2022,
       1975, 1987, 1980, 1981, 1982, 1965, 1984], dtype=int64)

In [41]:
# what are the unique value in Region column
df.Region.unique()

array(['Riyadh', 'Jeddah', 'Abha', 'Dammam', 'Qassim', 'Taef',
       'Al-Medina', 'Aseer', 'Wadi Dawasir', 'Al-Ahsa', 'Tabouk',
       'Makkah', 'Jazan', 'Khobar', 'Al-Jouf', 'Hafar Al-Batin', 'Yanbu',
       'Jubail', 'Najran', 'Al-Baha', 'Arar', 'Hail', 'Al-Namas',
       'Sakaka', 'Besha', 'Qurayyat', 'Sabya'], dtype=object)

In [27]:
# number of observation in each unique price value
df.Price.value_counts()

0         2021
45000      121
35000      107
55000      102
30000       94
          ...
56600        1
349000       1
445000       1
1013         1
1046         1
Name: Price, Length: 488, dtype: int64

In [33]:
# check the price if less than 100
df[df.Price < 100].Price.value_counts()

0    2021
1       1
Name: Price, dtype: int64

### Cleaning Data

#### Issues:
- Unnamed: 0 column is meaningless 
- Price column contain 2021 observations with the value (0) and one observation with value (1)

In [22]:
# first step is making a copy of the dataframe
df_clean = df.copy()

In [23]:
# renamimng the Unnamed: 0 column to  index
df_clean.rename(columns={'Unnamed: 0': 'index'}, inplace=True)

In [24]:
# setting the first column as index
df_clean = df_clean.set_index('index')

In [25]:
df_clean.head()

,Make,Type,Year,Origin,Color,Options,Engine_Size,Fuel_Type,Gear_Type,Mileage,Region,Price,Negotiable
index,,,,,,,,,,,,,
6153,Toyota,Camry,2020,Saudi,Brown,Semi Full,2.5,Gas,Automatic,38000,Riyadh,1364,False
4434,Toyota,FJ,2012,Saudi,Black,Full,4.0,Gas,Automatic,35000,Riyadh,70000,False
3537,Chevrolet,Suburban,2009,Saudi,White,Standard,5.3,Gas,Automatic,255,Riyadh,36000,False
1666,Ford,Explorer,2016,Other,White,Full,3.5,Gas,Automatic,128644,Riyadh,118000,False
3513,Toyota,Corolla,2018,Saudi,White,Standard,1.6,Gas,Automatic,19190,Jeddah,55000,False